INSERT INTO writing_practices (hiragana, romaji_list, step) VALUES
    ('あ', 'A', 1),
    ('い', 'I', 1),
    ('う', 'U', 1),
    ('え', 'E', 1),
    ('お', 'O', 1),

    ('か', 'KA', 1),
    ('き', 'KI', 1),
    ('く', 'KU', 1),
    ('け', 'KE', 1),
    ('こ', 'KO', 1),

    ('さ', 'SA', 1),
    ('し', 'SI,SHI', 1),
    ('す', 'SU', 1),
    ('せ', 'SE', 1),
    ('そ', 'SO', 1),

    ('た', 'TA', 1),
    ('ち', 'CHI,TI', 1),
    ('つ', 'TSU,TU', 1),
    ('て', 'TE', 1),
    ('と', 'TO', 1),

    ('な', 'NA', 1),
    ('に', 'NI', 1),
    ('ぬ', 'NU', 1),
    ('ね', 'NE', 1),
    ('の', 'NO', 1),

    ('は', 'HA', 1),
    ('ひ', 'HI', 1),
    ('ふ', 'FU,HU', 1),
    ('へ', 'HE', 1),
    ('ほ', 'HO', 1),

    ('ま', 'MA', 1),
    ('み', 'MI', 1),
    ('む', 'MU', 1),
    ('め', 'ME', 1),
    ('も', 'MO', 1),

    ('や', 'YA', 1),
    ('ゆ', 'YU', 1),
    ('よ', 'YO', 1),

    ('ら', 'RA', 1),
    ('り', 'RI', 1),
    ('る', 'RU', 1),
    ('れ', 'RE', 1),
    ('ろ', 'RO', 1),

    ('わ', 'WA', 1),
    ('うぃ', 'WI', 1),
    ('うぇ', 'WE', 1),
    ('を', 'WO', 1),

    ('ん', 'NN', 1);

INSERT INTO writing_practices (hiragana, romaji_list, step) VALUES
-- 濁音
    ('が', 'GA', 2),
    ('ぎ', 'GI', 2),
    ('ぐ', 'GU', 2),
    ('げ', 'GE', 2),
    ('ご', 'GO', 2),

    ('ざ', 'ZA', 2),
    ('じ', 'JI,ZI', 2),
    ('ず', 'ZU', 2),
    ('ぜ', 'ZE', 2),
    ('ぞ', 'ZO', 2),

    ('だ', 'DA', 2),
    ('ぢ', 'DI', 2),
    ('づ', 'DU', 2),
    ('で', 'DE', 2),
    ('ど', 'DO', 2),

    ('ば', 'BA', 2),
    ('び', 'BI', 2),
    ('ぶ', 'BU', 2),
    ('べ', 'BE', 2),
    ('ぼ', 'BO', 2),

    -- 半濁音
    ('ぱ', 'PA', 2),
    ('ぴ', 'PI', 2),
    ('ぷ', 'PU', 2),
    ('ぺ', 'PE', 2),
    ('ぽ', 'PO', 2),

    -- 小書き文字
    ('ぁ', 'LA,XA', 2),
    ('ぃ', 'LI,XI', 2),
    ('ぅ', 'LU,XU', 2),
    ('ぇ', 'LE,XE', 2),
    ('ぉ', 'LO,XO', 2),

    ('ゃ', 'LYA,XYA', 2),
    ('ゅ', 'LYU,XYU', 2),
    ('ょ', 'LYO,XYO', 2);

INSERT INTO writing_practices (hiragana, romaji_list, step) VALUES
    ('きゃ', 'KYA', 3),
    ('きゅ', 'KYU', 3),
    ('きょ', 'KYO', 3),

    ('しゃ', 'SHA,SYA', 3),
    ('しゅ', 'SHU,SYU', 3),
    ('しぇ', 'SHE,SYE', 3),
    ('しょ', 'SHO,SYO', 3),

    ('ちゃ', 'CHA,TYA', 3),
    ('ちゅ', 'CHU,TYU', 3),
    ('ちぇ', 'CHE,TYE', 3),
    ('ちょ', 'CHO,TYO', 3),

    ('にゃ', 'NYA', 3),
    ('にゅ', 'NYU', 3),
    ('にょ', 'NYO', 3),

    ('ひゃ', 'HYA', 3),
    ('ひゅ', 'HYU', 3),
    ('ひょ', 'HYO', 3),

    ('みゃ', 'MYA', 3),
    ('みゅ', 'MYU', 3),
    ('みょ', 'MYO', 3),

    ('りゃ', 'RYA', 3),
    ('りゅ', 'RYU', 3),
    ('りょ', 'RYO', 3),

    ('ぎゃ', 'GYA', 3),
    ('ぎゅ', 'GYU', 3),
    ('ぎょ', 'GYO', 3),

    ('じゃ', 'JA,JYA', 3),
    ('じゅ', 'JU,JYU', 3),
    ('じぇ', 'JE,JYE', 3),
    ('じょ', 'JO,JYO', 3),

    ('びゃ', 'BYA', 3),
    ('びゅ', 'BYU', 3),
    ('びょ', 'BYO', 3),

    ('ぴゃ', 'PYA', 3),
    ('ぴゅ', 'PYU', 3),
    ('ぴょ', 'PYO', 3);
